coanda_auto/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    down
    {
        type            patch;
        nFaces          162;
        startFace       45986;
    }
    right
    {
        type            patch;
        nFaces          161;
        startFace       46148;
    }
    up
    {
        type            patch;
        nFaces          168;
        startFace       46309;
    }
    meanFlow
    {
        type            patch;
        nFaces          92;
        startFace       46477;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          384;
        startFace       46569;
    }
    surfaceInner
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          90;
        startFace       46953;
    }
    coandaInlet
    {
        type            patch;
        nFaces          15;
        startFace       47043;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          46522;
        startFace       47058;
    }
)

// ************************************************************************* //
