coanda_auto/system/faces
boundary
(
    down
    {
        type patch;
        faces
        (
            (20 22 23 21)
            (22 24 25 23)
        );
    }
    right
    {
        type patch;
        faces
        (
            (24 26 27 25)
            (26 28 29 27)
            (28 30 31 29)
            (30 32 33 31)
            (32 34 35 33)
        );
    }
    up
    {
        type patch;
        faces
        (
            (34 36 37 35)
            (36 38 39 37)
            (38 40 41 39)
        );
    }
    meanFlow
    {
        type patch;
        faces
        (
            (40 48 49 41)
            (48 20 21 49)
        );
    }

    surface
    {
        type wall;
        faces
        (
            (42 44 45 43)
            (44 46 47 45)
            (46 14 15 47)            
            (12 16 17 13)
            (16 18 19 17)
            (42 50 51 43)
            (50 18 19 51)
        );
    }

    surfaceInner
    {
        type wall;
        faces
        (
            ( 0  2  3  1)
            ( 4  6  7  5)
            (14 10 11 15)
            (10  4  5 11)
            ( 2  8  9  3)
            ( 8 12 13  9)
        );
    }

    coandaInlet
    {
        type patch;
        faces
        (
            (0 6 7 1)
        );
    }
);
